In [ ]:
import pandas as pd

In [2]:
data_siswa = {
    "Nama": ["Hanif", "Arib", "Fawwaz", "Zufar", "Razin"],
    "Nilai": [90, 90, 100, 75, 70],
    "Kelas": ["1A","1B", "1C", "1D", "1E"]
}

df = pd.DataFrame(data_siswa)

In [3]:
df

     Nama  Nilai Kelas
0   Hanif     90    1A
1    Arib     90    1B
2  Fawwaz    100    1C
3   Zufar     75    1D
4   Razin     70    1E

In [5]:
df[df["Nilai"] > 80]

     Nama  Nilai Kelas
0   Hanif     90    1A
1    Arib     90    1B
2  Fawwaz    100    1C

In [10]:
df["Nilai"].mean()

85.0